astrobin_apps_payments/tests/data/ultimate_yearly_failed_payment/charge.failed.json

{
  "id": "evt_3NLu5hC0tT6bv7Hd1dD6TXpr",
  "object": "event",
  "api_version": "2020-08-27",
  "created": 1687465613,
  "data": {
    "object": {
      "id": "ch_3NLu5hC0tT6bv7Hd1M3pNJ3b",
      "object": "charge",
      "amount": 6700,
      "amount_captured": 0,
      "amount_refunded": 0,
      "application": null,
      "application_fee": null,
      "application_fee_amount": null,
      "balance_transaction": null,
      "billing_details": {
        "address": {
          "city": null,
          "country": "CH",
          "line1": null,
          "line2": null,
          "postal_code": null,
          "state": null
        },
        "email": "astrobin@astrobin.com",
        "name": "Test",
        "phone": null
      },
      "calculated_statement_descriptor": "ASTROBIN ULTIMATE",
      "captured": false,
      "created": 1687465613,
      "currency": "usd",
      "customer": "STRIPE_CUSTOMER_ID",
      "description": "Subscription creation",
      "destination": null,
      "dispute": null,
      "disputed": false,
      "failure_balance_transaction": null,
      "failure_code": "card_declined",
      "failure_message": "Your card has insufficient funds.",
      "fraud_details": {
      },
      "invoice": "in_1NLu5gC0tT6bv7Hdc6scsqIX",
      "livemode": false,
      "metadata": {
      },
      "on_behalf_of": null,
      "order": null,
      "outcome": {
        "network_status": "declined_by_network",
        "reason": "insufficient_funds",
        "risk_level": "normal",
        "risk_score": 39,
        "seller_message": "The bank returned the decline code `insufficient_funds`.",
        "type": "issuer_declined"
      },
      "paid": false,
      "payment_intent": "pi_3NLu5hC0tT6bv7Hd1QwnPhmo",
      "payment_method": "pm_1NLu5gC0tT6bv7HdglE2r1ra",
      "payment_method_details": {
        "card": {
          "brand": "visa",
          "checks": {
            "address_line1_check": null,
            "address_postal_code_check": null,
            "cvc_check": "pass"
          },
          "country": "US",
          "exp_month": 12,
          "exp_year": 2044,
          "fingerprint": "6MWGHmVLI3AltFQ6",
          "funding": "credit",
          "installments": null,
          "last4": "9995",
          "mandate": null,
          "network": "visa",
          "network_token": {
            "used": false
          },
          "three_d_secure": null,
          "wallet": null
        },
        "type": "card"
      },
      "receipt_email": "astrobin@astrobin.com",
      "receipt_number": null,
      "receipt_url": null,
      "refunded": false,
      "refunds": {
        "object": "list",
        "data": [
        ],
        "has_more": false,
        "total_count": 0,
        "url": "/v1/charges/ch_3NLu5hC0tT6bv7Hd1M3pNJ3b/refunds"
      },
      "review": null,
      "shipping": null,
      "source": null,
      "source_transfer": null,
      "statement_descriptor": "AstroBin Ultimate",
      "statement_descriptor_suffix": null,
      "status": "failed",
      "transfer_data": null,
      "transfer_group": null
    }
  },
  "livemode": false,
  "pending_webhooks": 3,
  "request": {
    "id": "req_nPPxIv4IDWpPyN",
    "idempotency_key": "43595b7c-f016-4d5c-9f94-b1f5157f1d55"
  },
  "type": "charge.failed"
}
