astrobin_apps_payments/tests/data/ultimate_yearly_failed_payment/payment_intent.created.json

{
  "id": "evt_3NLu5hC0tT6bv7Hd1sZWGfxQ",
  "object": "event",
  "api_version": "2020-08-27",
  "created": 1687465613,
  "data": {
    "object": {
      "id": "pi_3NLu5hC0tT6bv7Hd1QwnPhmo",
      "object": "payment_intent",
      "amount": 6700,
      "amount_capturable": 0,
      "amount_details": {
        "tip": {
        }
      },
      "amount_received": 0,
      "application": null,
      "application_fee_amount": null,
      "automatic_payment_methods": null,
      "canceled_at": null,
      "cancellation_reason": null,
      "capture_method": "automatic",
      "charges": {
        "object": "list",
        "data": [
        ],
        "has_more": false,
        "total_count": 0,
        "url": "/v1/charges?payment_intent=pi_3NLu5hC0tT6bv7Hd1QwnPhmo"
      },
      "client_secret": "pi_3NLu5hC0tT6bv7Hd1QwnPhmo_secret_5c1DzQ2dYlAp96ODhXEMuONTX",
      "confirmation_method": "automatic",
      "created": 1687465613,
      "currency": "usd",
      "customer": "STRIPE_CUSTOMER_ID",
      "description": "Subscription creation",
      "invoice": "in_1NLu5gC0tT6bv7Hdc6scsqIX",
      "last_payment_error": null,
      "latest_charge": null,
      "livemode": false,
      "metadata": {
      },
      "next_action": null,
      "on_behalf_of": null,
      "payment_method": null,
      "payment_method_options": {
        "card": {
          "installments": null,
          "mandate_options": null,
          "network": null,
          "request_three_d_secure": "automatic"
        },
        "paypal": {
          "preferred_locale": null,
          "reference": null
        }
      },
      "payment_method_types": [
        "card",
        "paypal"
      ],
      "processing": null,
      "receipt_email": "astrobin@astrobin.com",
      "review": null,
      "setup_future_usage": "off_session",
      "shipping": null,
      "source": null,
      "statement_descriptor": "AstroBin Ultimate",
      "statement_descriptor_suffix": null,
      "status": "requires_payment_method",
      "transfer_data": null,
      "transfer_group": null
    }
  },
  "livemode": false,
  "pending_webhooks": 1,
  "request": {
    "id": "req_nPPxIv4IDWpPyN",
    "idempotency_key": "43595b7c-f016-4d5c-9f94-b1f5157f1d55"
  },
  "type": "payment_intent.created"
}
