astrobin_apps_payments/tests/data/ultimate_yearly_failed_payment_then_changed_subscription/payment_intent.payment_failed.json

{
  "id": "evt_3NLu5hC0tT6bv7Hd11i1aPuT",
  "object": "event",
  "api_version": "2020-08-27",
  "created": 1687465614,
  "data": {
    "object": {
      "id": "pi_3NLu5hC0tT6bv7Hd1QwnPhmo",
      "object": "payment_intent",
      "amount": 6700,
      "amount_capturable": 0,
      "amount_details": {
        "tip": {
        }
      },
      "amount_received": 0,
      "application": null,
      "application_fee_amount": null,
      "automatic_payment_methods": null,
      "canceled_at": null,
      "cancellation_reason": null,
      "capture_method": "automatic",
      "charges": {
        "object": "list",
        "data": [
          {
            "id": "ch_3NLu5hC0tT6bv7Hd1M3pNJ3b",
            "object": "charge",
            "amount": 6700,
            "amount_captured": 0,
            "amount_refunded": 0,
            "application": null,
            "application_fee": null,
            "application_fee_amount": null,
            "balance_transaction": null,
            "billing_details": {
              "address": {
                "city": null,
                "country": "CH",
                "line1": null,
                "line2": null,
                "postal_code": null,
                "state": null
              },
              "email": "astrobin@astrobin.com",
              "name": "Test",
              "phone": null
            },
            "calculated_statement_descriptor": "ASTROBIN ULTIMATE",
            "captured": false,
            "created": 1687465613,
            "currency": "usd",
            "customer": "STRIPE_CUSTOMER_ID",
            "description": "Subscription creation",
            "destination": null,
            "dispute": null,
            "disputed": false,
            "failure_balance_transaction": null,
            "failure_code": "card_declined",
            "failure_message": "Your card has insufficient funds.",
            "fraud_details": {
            },
            "invoice": "in_1NLu5gC0tT6bv7Hdc6scsqIX",
            "livemode": false,
            "metadata": {
            },
            "on_behalf_of": null,
            "order": null,
            "outcome": {
              "network_status": "declined_by_network",
              "reason": "insufficient_funds",
              "risk_level": "normal",
              "risk_score": 39,
              "seller_message": "The bank returned the decline code `insufficient_funds`.",
              "type": "issuer_declined"
            },
            "paid": false,
            "payment_intent": "pi_3NLu5hC0tT6bv7Hd1QwnPhmo",
            "payment_method": "pm_1NLu5gC0tT6bv7HdglE2r1ra",
            "payment_method_details": {
              "card": {
                "brand": "visa",
                "checks": {
                  "address_line1_check": null,
                  "address_postal_code_check": null,
                  "cvc_check": "pass"
                },
                "country": "US",
                "exp_month": 12,
                "exp_year": 2044,
                "fingerprint": "6MWGHmVLI3AltFQ6",
                "funding": "credit",
                "installments": null,
                "last4": "9995",
                "mandate": null,
                "network": "visa",
                "network_token": {
                  "used": false
                },
                "three_d_secure": null,
                "wallet": null
              },
              "type": "card"
            },
            "receipt_email": "astrobin@astrobin.com",
            "receipt_number": null,
            "receipt_url": null,
            "refunded": false,
            "refunds": {
              "object": "list",
              "data": [
              ],
              "has_more": false,
              "total_count": 0,
              "url": "/v1/charges/ch_3NLu5hC0tT6bv7Hd1M3pNJ3b/refunds"
            },
            "review": null,
            "shipping": null,
            "source": null,
            "source_transfer": null,
            "statement_descriptor": "AstroBin Ultimate",
            "statement_descriptor_suffix": null,
            "status": "failed",
            "transfer_data": null,
            "transfer_group": null
          }
        ],
        "has_more": false,
        "total_count": 1,
        "url": "/v1/charges?payment_intent=pi_3NLu5hC0tT6bv7Hd1QwnPhmo"
      },
      "client_secret": "pi_3NLu5hC0tT6bv7Hd1QwnPhmo_secret_5c1DzQ2dYlAp96ODhXEMuONTX",
      "confirmation_method": "automatic",
      "created": 1687465613,
      "currency": "usd",
      "customer": "STRIPE_CUSTOMER_ID",
      "description": "Subscription creation",
      "invoice": "in_1NLu5gC0tT6bv7Hdc6scsqIX",
      "last_payment_error": {
        "charge": "ch_3NLu5hC0tT6bv7Hd1M3pNJ3b",
        "code": "card_declined",
        "decline_code": "insufficient_funds",
        "doc_url": "https://stripe.com/docs/error-codes/card-declined",
        "message": "Your card has insufficient funds.",
        "payment_method": {
          "id": "pm_1NLu5gC0tT6bv7HdglE2r1ra",
          "object": "payment_method",
          "billing_details": {
            "address": {
              "city": null,
              "country": "CH",
              "line1": null,
              "line2": null,
              "postal_code": null,
              "state": null
            },
            "email": "astrobin@astrobin.com",
            "name": "Test",
            "phone": null
          },
          "card": {
            "brand": "visa",
            "checks": {
              "address_line1_check": null,
              "address_postal_code_check": null,
              "cvc_check": "pass"
            },
            "country": "US",
            "exp_month": 12,
            "exp_year": 2044,
            "fingerprint": "6MWGHmVLI3AltFQ6",
            "funding": "credit",
            "generated_from": null,
            "last4": "9995",
            "networks": {
              "available": [
                "visa"
              ],
              "preferred": null
            },
            "three_d_secure_usage": {
              "supported": true
            },
            "wallet": null
          },
          "created": 1687465612,
          "customer": null,
          "livemode": false,
          "metadata": {
          },
          "type": "card"
        },
        "type": "card_error"
      },
      "latest_charge": "ch_3NLu5hC0tT6bv7Hd1M3pNJ3b",
      "livemode": false,
      "metadata": {
      },
      "next_action": null,
      "on_behalf_of": null,
      "payment_method": null,
      "payment_method_options": {
        "card": {
          "installments": null,
          "mandate_options": null,
          "network": null,
          "request_three_d_secure": "automatic",
          "setup_future_usage": "off_session"
        },
        "paypal": {
          "preferred_locale": null,
          "reference": null
        }
      },
      "payment_method_types": [
        "card",
        "paypal"
      ],
      "processing": null,
      "receipt_email": "astrobin@astrobin.com",
      "review": null,
      "setup_future_usage": "off_session",
      "shipping": null,
      "source": null,
      "statement_descriptor": "AstroBin Ultimate",
      "statement_descriptor_suffix": null,
      "status": "requires_payment_method",
      "transfer_data": null,
      "transfer_group": null
    }
  },
  "livemode": false,
  "pending_webhooks": 1,
  "request": {
    "id": "req_nPPxIv4IDWpPyN",
    "idempotency_key": "43595b7c-f016-4d5c-9f94-b1f5157f1d55"
  },
  "type": "payment_intent.payment_failed"
}
