astrobin_apps_payments/tests/data/ultimate_yearly_renewal/invoice.updated.json

{
  "id": "evt_1NC61aC0tT6bv7HdyNEVeyP6",
  "object": "event",
  "api_version": "2020-08-27",
  "created": 1685128206,
  "data": {
    "object": {
      "id": "in_1NC5yVC0tT6bv7HdxPNLxFMO",
      "object": "invoice",
      "account_country": "CH",
      "account_name": "AstroBin",
      "account_tax_ids": null,
      "amount_due": 6000,
      "amount_paid": 6000,
      "amount_remaining": 0,
      "amount_shipping": 0,
      "application": null,
      "application_fee_amount": null,
      "attempt_count": 1,
      "attempted": true,
      "auto_advance": false,
      "automatic_tax": {
        "enabled": false,
        "status": null
      },
      "billing_reason": "subscription_cycle",
      "charge": "ch_3NC61XC0tT6bv7Hd0UodWJyr",
      "collection_method": "charge_automatically",
      "created": STRIPE_EVENT_START_TIMESTAMP,
      "currency": "chf",
      "custom_fields": null,
      "customer": "STRIPE_CUSTOMER_ID",
      "customer_address": null,
      "customer_email": "astrobin@astrobin.com",
      "customer_name": "Test User",
      "customer_phone": null,
      "customer_shipping": null,
      "customer_tax_exempt": "none",
      "customer_tax_ids": [
      ],
      "default_payment_method": null,
      "default_source": null,
      "default_tax_rates": [
      ],
      "description": null,
      "discount": null,
      "discounts": [
      ],
      "due_date": null,
      "ending_balance": 0,
      "footer": null,
      "from_invoice": null,
      "hosted_invoice_url": "https://invoice.stripe.com/i/acct_1BW8j3C0tT6bv7Hd/test_YWNjdF8xQlc4ajNDMHRUNmJ2N0hkLF9OeTIyN095STFtVVNtWVdtMkFZbUZXczh0WUxWZUtJLDc1NjY5MDA20200VFgbcJ6s?s=ap",
      "invoice_pdf": "https://pay.stripe.com/invoice/acct_1BW8j3C0tT6bv7Hd/test_YWNjdF8xQlc4ajNDMHRUNmJ2N0hkLF9OeTIyN095STFtVVNtWVdtMkFZbUZXczh0WUxWZUtJLDc1NjY5MDA20200VFgbcJ6s/pdf?s=ap",
      "last_finalization_error": null,
      "latest_revision": null,
      "lines": {
        "object": "list",
        "data": [
          {
            "id": "il_1PKmKdC0tT6bv7HdaXZL5Kat",
            "object": "line_item",
            "amount": 6000,
            "amount_excluding_tax": 6000,
            "currency": "chf",
            "description": "1 × AstroBin Ultimate (at CHF 60.00 / year)",
            "discount_amounts": [
            ],
            "discountable": true,
            "discounts": [
            ],
            "livemode": false,
            "metadata": {
            },
            "period": {
              "end": STRIPE_EVENT_END_TIMESTAMP,
              "start": STRIPE_EVENT_START_TIMESTAMP
            },
            "plan": {
              "id": "price_1NAtotC0tT6bv7Hd2LUGNacO",
              "object": "plan",
              "active": true,
              "aggregate_usage": null,
              "amount": 6000,
              "amount_decimal": "6000",
              "billing_scheme": "per_unit",
              "created": 1684842963,
              "currency": "chf",
              "interval": "year",
              "interval_count": 1,
              "livemode": false,
              "metadata": {
              },
              "nickname": "AstroBin Ultimate 1 year recurring (tier 1)",
              "product": "STRIPE_PRODUCT_ULTIMATE_TEST",
              "tiers_mode": null,
              "transform_usage": null,
              "trial_period_days": null,
              "usage_type": "licensed"
            },
            "price": {
              "id": "price_1NAtotC0tT6bv7Hd2LUGNacO",
              "object": "price",
              "active": true,
              "billing_scheme": "per_unit",
              "created": 1684842963,
              "currency": "chf",
              "custom_unit_amount": null,
              "livemode": false,
              "lookup_key": null,
              "metadata": {
              },
              "nickname": "AstroBin Ultimate 1 year recurring (tier 1)",
              "product": "STRIPE_PRODUCT_ULTIMATE_TEST",
              "recurring": {
                "aggregate_usage": null,
                "interval": "year",
                "interval_count": 1,
                "trial_period_days": null,
                "usage_type": "licensed"
              },
              "tax_behavior": "exclusive",
              "tiers_mode": null,
              "transform_quantity": null,
              "type": "recurring",
              "unit_amount": 6000,
              "unit_amount_decimal": "6000"
            },
            "proration": false,
            "proration_details": {
              "credited_items": null
            },
            "quantity": 1,
            "subscription": "sub_1NC5wgC0tT6bv7HdAAlrRAw0",
            "subscription_item": "si_Ny20DpKXIWi0v0",
            "tax_amounts": [
            ],
            "tax_rates": [
            ],
            "type": "subscription",
            "unit_amount_excluding_tax": "6000"
          }
        ],
        "has_more": false,
        "total_count": 1,
        "url": "/v1/invoices/in_1NC5yVC0tT6bv7HdxPNLxFMO/lines"
      },
      "livemode": false,
      "metadata": {
      },
      "next_payment_attempt": null,
      "number": "02740FAC-0002",
      "on_behalf_of": null,
      "paid": true,
      "paid_out_of_band": false,
      "payment_intent": "pi_3NC61XC0tT6bv7Hd0wUDl2Lv",
      "payment_settings": {
        "default_mandate": null,
        "payment_method_options": null,
        "payment_method_types": null
      },
      "period_end": STRIPE_EVENT_START_TIMESTAMP,
      "period_start": 1685127731,
      "post_payment_credit_notes_amount": 0,
      "pre_payment_credit_notes_amount": 0,
      "quote": null,
      "receipt_number": null,
      "rendering_options": null,
      "shipping_cost": null,
      "shipping_details": null,
      "starting_balance": 0,
      "statement_descriptor": null,
      "status": "paid",
      "status_transitions": {
        "finalized_at": 1716840131,
        "marked_uncollectible_at": null,
        "paid_at": 1716840131,
        "voided_at": null
      },
      "subscription": "sub_1NC5wgC0tT6bv7HdAAlrRAw0",
      "subtotal": 6000,
      "subtotal_excluding_tax": 6000,
      "tax": null,
      "test_clock": "clock_1NC5tzC0tT6bv7HdckRzJXSm",
      "total": 6000,
      "total_discount_amounts": [
      ],
      "total_excluding_tax": 6000,
      "total_tax_amounts": [
      ],
      "transfer_data": null,
      "webhooks_delivered_at": 1716836531
    },
    "previous_attributes": {
      "amount_paid": 0,
      "amount_remaining": 6000,
      "attempt_count": 0,
      "attempted": false,
      "auto_advance": true,
      "charge": null,
      "ending_balance": null,
      "hosted_invoice_url": null,
      "invoice_pdf": null,
      "next_payment_attempt": 1716753731,
      "number": null,
      "paid": false,
      "payment_intent": null,
      "status": "draft",
      "status_transitions": {
        "finalized_at": null,
        "paid_at": null
      }
    }
  },
  "livemode": false,
  "pending_webhooks": 1,
  "request": {
    "id": null,
    "idempotency_key": null
  },
  "type": "invoice.updated"
}
