astrobin_apps_payments/tests/data/ultimate_yearly_renewal/payment_intent.succeeded.json

{
  "id": "evt_3NC61XC0tT6bv7Hd0syEZfwM",
  "object": "event",
  "api_version": "2020-08-27",
  "created": 1685128205,
  "data": {
    "object": {
      "id": "pi_3NC61XC0tT6bv7Hd0wUDl2Lv",
      "object": "payment_intent",
      "amount": 6000,
      "amount_capturable": 0,
      "amount_details": {
        "tip": {
        }
      },
      "amount_received": 6000,
      "application": null,
      "application_fee_amount": null,
      "automatic_payment_methods": null,
      "canceled_at": null,
      "cancellation_reason": null,
      "capture_method": "automatic",
      "charges": {
        "object": "list",
        "data": [
          {
            "id": "ch_3NC61XC0tT6bv7Hd0UodWJyr",
            "object": "charge",
            "amount": 6000,
            "amount_captured": 6000,
            "amount_refunded": 0,
            "application": null,
            "application_fee": null,
            "application_fee_amount": null,
            "balance_transaction": "txn_3NC61XC0tT6bv7Hd026tTT0W",
            "billing_details": {
              "address": {
                "city": null,
                "country": null,
                "line1": null,
                "line2": null,
                "postal_code": null,
                "state": null
              },
              "email": null,
              "name": null,
              "phone": null
            },
            "calculated_statement_descriptor": "ASTROBIN ULTIMATE",
            "captured": true,
            "created": 1685128204,
            "currency": "chf",
            "customer": "STRIPE_CUSTOMER_ID",
            "description": "Subscription update",
            "destination": null,
            "dispute": null,
            "disputed": false,
            "failure_balance_transaction": null,
            "failure_code": null,
            "failure_message": null,
            "fraud_details": {
            },
            "invoice": "in_1NC5yVC0tT6bv7HdxPNLxFMO",
            "livemode": false,
            "metadata": {
            },
            "on_behalf_of": null,
            "order": null,
            "outcome": {
              "network_status": "approved_by_network",
              "reason": null,
              "risk_level": "normal",
              "risk_score": 42,
              "seller_message": "Payment complete.",
              "type": "authorized"
            },
            "paid": true,
            "payment_intent": "pi_3NC61XC0tT6bv7Hd0wUDl2Lv",
            "payment_method": "card_1NC5wcC0tT6bv7HdWOSqGgH4",
            "payment_method_details": {
              "card": {
                "brand": "visa",
                "checks": {
                  "address_line1_check": null,
                  "address_postal_code_check": null,
                  "cvc_check": "pass"
                },
                "country": "US",
                "exp_month": 12,
                "exp_year": 2073,
                "fingerprint": "Xi05hB6PSTV4ACeF",
                "funding": "credit",
                "installments": null,
                "last4": "4242",
                "mandate": null,
                "network": "visa",
                "network_token": {
                  "used": false
                },
                "three_d_secure": null,
                "wallet": null
              },
              "type": "card"
            },
            "receipt_email": "astrobin@astrobin.com",
            "receipt_number": null,
            "receipt_url": "https://pay.stripe.com/receipts/invoices/CAcaFwoVYWNjdF8xQlc4ajNDMHRUNmJ2N0hkKI2IxKMGMgbeOKBtPlc6LBZlgA6BcBaEsJ8_pRfVEceKUb6ujgR627sIOQp0_grrHCmgzfIX2rrQ0NnO?s=ap",
            "refunded": false,
            "refunds": {
              "object": "list",
              "data": [
              ],
              "has_more": false,
              "total_count": 0,
              "url": "/v1/charges/ch_3NC61XC0tT6bv7Hd0UodWJyr/refunds"
            },
            "review": null,
            "shipping": null,
            "source": {
              "id": "card_1NC5wcC0tT6bv7HdWOSqGgH4",
              "object": "card",
              "address_city": null,
              "address_country": null,
              "address_line1": null,
              "address_line1_check": null,
              "address_line2": null,
              "address_state": null,
              "address_zip": null,
              "address_zip_check": null,
              "brand": "Visa",
              "country": "US",
              "customer": "STRIPE_CUSTOMER_ID",
              "cvc_check": "pass",
              "dynamic_last4": null,
              "exp_month": 12,
              "exp_year": 2073,
              "fingerprint": "Xi05hB6PSTV4ACeF",
              "funding": "credit",
              "last4": "4242",
              "metadata": {
              },
              "name": null,
              "tokenization_method": null,
              "wallet": null
            },
            "source_transfer": null,
            "statement_descriptor": "AstroBin Ultimate",
            "statement_descriptor_suffix": null,
            "status": "succeeded",
            "transfer_data": null,
            "transfer_group": null
          }
        ],
        "has_more": false,
        "total_count": 1,
        "url": "/v1/charges?payment_intent=pi_3NC61XC0tT6bv7Hd0wUDl2Lv"
      },
      "client_secret": "pi_3NC61XC0tT6bv7Hd0wUDl2Lv_secret_XsjCVuyISbvtNUqP4B7qVLA14",
      "confirmation_method": "automatic",
      "created": 1685128203,
      "currency": "chf",
      "customer": "STRIPE_CUSTOMER_ID",
      "description": "Subscription update",
      "invoice": "in_1NC5yVC0tT6bv7HdxPNLxFMO",
      "last_payment_error": null,
      "latest_charge": "ch_3NC61XC0tT6bv7Hd0UodWJyr",
      "livemode": false,
      "metadata": {
      },
      "next_action": null,
      "on_behalf_of": null,
      "payment_method": null,
      "payment_method_options": {
        "card": {
          "installments": null,
          "mandate_options": null,
          "network": null,
          "request_three_d_secure": "automatic"
        },
        "paypal": {
          "preferred_locale": null,
          "reference": null
        }
      },
      "payment_method_types": [
        "card",
        "paypal"
      ],
      "processing": null,
      "receipt_email": "astrobin@astrobin.com",
      "review": null,
      "setup_future_usage": null,
      "shipping": null,
      "source": "card_1NC5wcC0tT6bv7HdWOSqGgH4",
      "statement_descriptor": "AstroBin Ultimate",
      "statement_descriptor_suffix": null,
      "status": "succeeded",
      "transfer_data": null,
      "transfer_group": null
    }
  },
  "livemode": false,
  "pending_webhooks": 1,
  "request": {
    "id": null,
    "idempotency_key": "in_1NC5yVC0tT6bv7HdxPNLxFMO-initial_attempt-e6d611c444f3fe471"
  },
  "type": "payment_intent.succeeded"
}
